[
  {
    "id": "exp_parsons_2025",
    "company": "Parsons Corporation",
    "role": "Software Engineer Intern",
    "dates": { "start": "2025-05", "end": "2025-08" },
    "summary": "Built automated .NET/C# data-integration services feeding Power BI for daily US Air Force users; designed pipeline to reduce API calls and improved stakeholder-facing layouts.",
    "specifics": [
      "Designed a C#/.NET pipeline to consume external APIs, normalize records, and sync into SQL with schema optimizations for report performance.",
      "Implemented request de-duplication and caching, reducing third-party API calls by ~40% while maintaining freshness SLAs.",
      "Integrated with AWS-hosted services and Power BI Embedded; hardened auth and connection lifecycle.",
      "Refactored dashboard layout and data contract for clearer decision support across USAF housing workflows.",
      "Recognized with a 2026 return offer for rapid ramp-up on .NET and platform ownership."
    ],
    "skills": ["csharp", "dotnet", "aws", "power_bi", "api_integration"],
    "links": { "company": "https://www.parsons.com/" },
    "tags": ["internship", "data-integration", "analytics", "gov"]
  },
  {
    "id": "exp_lilie_2024",
    "company": "Liu Idea Lab for Innovation & Entrepreneurship (Rice)",
    "role": "Software Engineer in Residence",
    "dates": { "start": "2024-02", "end": "2024-11" },
    "summary": "Led early development for Rice’s entrepreneurship platform, combining full-stack development with user research to shape product direction and help design coursework to teach founders how to build with software.",
    "aliases": ["Lilie", "Liu Idea Lab", "Rice Lilie"],
    "specifics": [
      "Conducted 40+ user interviews with student founders and faculty to identify key needs in entrepreneurship education and resource access.",
      "Designed and prototyped full-stack platform concepts in React, TypeScript, and Supabase, creating mockups for course management, venture tracking, and mentorship tools.",
      "Collaborated weekly with student founders to gather feedback and refine designs that could streamline startup support and community visibility.",
      "Assisted faculty with curriculum updates that empowered non-technical students to build MVPs and leverage software tools in their ventures."
    ],
    "skills": ["typescript", "react", "supabase", "product_management", "user_research", "ux_design"],
    "links": { "company": "https://entrepreneurship.rice.edu/" },
    "tags": ["platform", "product", "full-stack", "edtech"]
  },
  {
    "id": "exp_veson_2024",
    "company": "Veson Nautical",
    "role": "Software Engineering Intern (IMOS – Laytime Automation)",
    "dates": { "start": "2024-06", "end": "2024-09" },
    "summary": "Built a high-throughput document-processing pipeline (Google Document AI + Python) to automate laytime calculations; reduced multi-day workflows to ~8 minutes.",
    "specifics": [
      "Parsed PDFs/EMLs/XLSX and nested attachments at scale (100+ docs per batch) using Google Document AI with parallel execution.",
      "Extracted Statement of Facts, Charter Parties, vendor calculations, and 15+ doc classes; normalized into a contract-aware schema.",
      "Implemented rule engines that codified client-specific laytime clauses; cross-checked vendor demurrage against computed results.",
      "Delivered Streamlit prototypes and initiated IMOS integration; iterated daily with enterprise stakeholders under tight deadlines.",
      "Consultative work helped close four multi-million-dollar annual deals within one month by demonstrating speed and accuracy."
    ],
    "skills": ["python", "google_document_ai", "streamlit", "rule_engines", "data_extraction", "api_integration", "docker", "typescript"],
    "links": { "company": "https://veson.com/" },
    "tags": ["automation", "nlp-vision", "enterprise", "maritime"]
  },
  {
    "id": "exp_vesselsvalue_2024",
    "company": "VesselsValue",
    "role": "Data Science Intern",
    "dates": { "start": "2024-05", "end": "2024-06" },
    "summary": "Shipped NLP clustering and entity-matching pipelines (Sentence Transformers + FAISS) achieving ~97% title-category accuracy; improved company merge precision >20%.",
    "specifics": [
      "Built job-title classifier using SentenceTransformer embeddings; tuned thresholds and stop-word handling for noisy maritime data.",
      "Designed FAISS-based similarity search to merge 600k+ companies; improved matching precision by >20% versus legacy methods.",
      "Automated an ingestion/cleaning pipeline to refresh leads and segmentation; cut outreach cycle time ~70%.",
      "Partnered with PMs to productize insights and tighten feedback loops into roadmap decisions."
    ],
    "skills": ["python", "sentence_transformers", "faiss", "pandas", "numpy", "model_evaluation", "feature_engineering", "machine_learning"],
    "links": { "company": "https://www.vesselsvalue.com/" },
    "tags": ["nlp", "search", "data-quality", "ml-platform"]
  },
  {
    "id": "exp_veson_mobile_2021_2023",
    "company": "Veson Nautical",
    "role": "Software Development Intern (Mobile)",
    "dates": { "start": "2021-06", "end": "2023-06" },
    "summary": "One of three frontend iOS devs on Veson’s first mobile app; enabled on-the-go access to voyage/cargo data and drove broad client adoption.",
    "specifics": [
      "Built Swift UI features, API client, and offline-tolerant data flows; coordinated sprint integration with the platform team.",
      "Presented builds to enterprise users; incorporated feedback for usability and reliability improvements.",
      "Introduced >50% of surveyed clients to mobile workflows; reduced time-to-data by ~30% versus desktop access.",
      "Established CI/CD hygiene and release rituals with Atlassian tooling."
    ],
    "skills": ["swift", "xcode", "api_integration", "ci_cd", "product_management", "ios_development"],
    "links": { "company": "https://veson.com/" },
    "tags": ["ios", "mobile", "enterprise"]
  }
]
