{
  "name": "Michael (Mike) Konstantinos Veson",
  "headline": "CS Junior @ Rice",
  "bio": "Junior at Rice studying computer science, probably graduating May 2027. Grew up in Boston watching my parents build Veson Nautical; learned early that you can make something meaningful if you care about the problem and the people. Spent Fall 2025 studying abroad in Barcelona. Traveled around Europe, got to see my lifelong club Barça play week in week out at the new Camp Nou, and spent the semester getting better at Spanish and Greek. Had a lot of conversations about what people should want out of life. I learned the hard way that it doesn't matter how hard you work if you're working hard for the wrong reasons. So I started spending more time figuring out what's worth doing in the first place, and now I'm building products to help with that. I love talking to people about what success means to them. Not success in the typical sense, but a life that fulfills you every day for reasons true to who you are. Learning more every day through writing books, blogs, movie scripts, and having conversations with people who push me forward.",
  "mission": "Help humans transition from survival-focused living to flourishing-focused living. The ancient Greeks called it eudaimonia—the practice of living excellently according to who you actually are. I'm building tools to make that possible at scale.",
  "work_authorization": "U.S. Citizen, Greek Citizen",
  "location": "Houston / Boston",
  "availability": "Incoming SWE Intern at Google (Summer 2026); available for full-time roles starting 2027",
  "language_proficiency": ["English (native)", "Greek (intermediate)", "Spanish (intermediate)"],
  "education": [
    {
      "school": "Rice University",
      "degree": "B.S. Computer Science",
      "gpa": "3.88",
      "expected_grad": "May 2027"
    }
  ],
  "key_values": [
    {
      "value": "Growth Orientation",
      "why": "I'm not defending who I've been—I'm actively becoming who I want to be. My idol is me in five years, and I'm always trying to close that gap. This means being willing to fail, revise my beliefs when evidence contradicts them, and prioritize getting better over looking good."
    },
    {
      "value": "Integrity",
      "why": "Being honest with myself and others is non-negotiable. I want to look back on any situation and know I showed up authentically, even when it was hard. No performing, no pretending to be someone I'm not."
    },
    {
      "value": "Serenity",
      "why": "I live by the Serenity Prayer: accept what I can't change, change what I can, know the difference. It's how I stay grounded when things get chaotic. Instead of fighting unchangeable circumstances, I focus my energy on what's actually within my control."
    },
    {
      "value": "Signal Over Noise",
      "why": "Most of life gets spent on things that don't actually matter—busywork, performative actions, passive consumption. I try to maximize time spent on what I actually care about (creation, connection, growth) and minimize the rest. This is the core philosophy behind everything I build."
    }
  ],
  "interests": [
    {
      "interest": "Building AI Products",
      "why": "I love the full stack: understanding human problems, designing systems that solve them, shipping code that actually works. My current obsession is AI that helps people flourish—not just do more tasks, but live better lives. Project Olympus is where this comes together."
    },
    {
      "interest": "Philosophy & Human Flourishing",
      "why": "I've been studying Aristotle's concept of eudaimonia—flourishing, living excellently according to who you actually are. This isn't abstract to me; it's the operating system for everything I build. I maintain a personal framework called the Tree of Human Flourishing that breaks down what humans actually need (autonomy, competence, connection, meaning)."
    },
    {
      "interest": "Writing & Pattern Recognition",
      "why": "I've kept a running document of life lessons since high school—patterns I've noticed, mistakes I don't want to repeat, frameworks that help me think. Writing is how I process. Long-term, I want to create stories that help people see themselves more clearly."
    },
    {
      "interest": "Languages & Culture",
      "why": "Greek is my heritage, Spanish came from Barcelona. I see language as a way to actually understand how people in different cultures think—not just translate words, but understand worldviews."
    },
    {
      "interest": "FC Barcelona",
      "why": "My grandfather Kostas is from Poros, and the island has always supported Barcelona. Watching matches—in person in Barcelona, at the fan tavern in Houston—is one of the things that feels like genuine leisure, not just killing time."
    }
  ],
  "family": {
    "parents": [
      "Eva Douzinas",
      "John Veson"
    ],
    "siblings": [
      "Natalie Veson",
      "Konstantinos Veson"
    ],
    "pets": [
      {
        "name": "Callie",
        "note": "white golden retriever"
      },
      {
        "name": "Cooper",
        "note": "orange golden retriever"
      }
    ],
    "grandparents": [
      "Kostas Douzinas",
      "Nancy Douzinas",
      "Mary Veson",
      "Michael Veson (deceased)"
    ],
    "stories": [
      {
        "id": "veson_nautical_roots",
        "title": "Family roots in maritime software",
        "text": "Both my grandfathers founded shipping software companies. Michael Veson started Veson Inc., Kostas Douzinas started Nautical Corporation. My parents met, and later started Veson Nautical together. I grew up watching them build it from the ground up. In high school I helped out and ended up shipping the first Veson Nautical mobile app. That's where I learned what software can actually do for people—and that building something meaningful is a family tradition I want to continue."
      },
      {
        "id": "barcelona_growth",
        "title": "Barcelona and finding direction",
        "text": "I spent Fall 2025 studying abroad in Barcelona, and it turned into one of the most formative periods of my life. Away from my normal context, I had space to think seriously about what I actually want to build and why. That's when Project Olympus crystallized—not as a cool tech project, but as an answer to a real question: how do we help people spend their time on things that actually matter? The combination of philosophy, product thinking, and technical execution came together there."
      },
      {
        "id": "approach_to_building",
        "title": "How Mike approaches building",
        "text": "I don't just want to build things that work—I want to build things that matter. Every technical decision should connect back to human impact. I think in frameworks and systems, not just features. I care about the 'why' as much as the 'how'. And I believe the best products come from deeply understanding human nature, not just user research."
      }
    ]
  }
}