{
  "name": "Michael (Mike) Konstantinos Veson",
  "headline": "Junior, Computer Science @ Rice University | Builder · Leader · Philanthropist",
  "bio": "Product-obsessed engineer who treats building as both craft and calling. I bring relentless energy into every room, obsess over the details, and stay grounded by core values - integrity, creativity, ambition, serenity. I live for the pressure and the chance to make life better for the people around me, balancing late-night builds with learning new languages, countries, and ideas. I don't settle for mediocre; I'm intent on becoming the best version of myself for my teams and the communities I serve.",
  "work_authorization": "U.S. Citizen, Greek Citizen",
  "location": "Barcelona (Fall 2025 & Spring 2026) / Boston / Housing in New York City / School in Houston",
  "availability": "Actively pursuing Summer 2026 internships; available for full-time roles starting Summer 2027",
  "language_proficiency": ["English (native)", "Greek (intermediate)", "Spanish (intermediate)"],
  "education": [
    {
      "school": "Rice University",
      "degree": "B.S. Computer Science",
      "gpa": "3.88",
      "expected_grad": "May 2027"
    }
  ],
  "key_values": [
    {
      "value": "Integrity",
      "why": "I believe I have a duty as a person to always give my all to do the right thing. To me, being honest and transparent with myself and others is the most important thing I can do."
    },
    {
      "value": "Ambition",
      "why": "I am someone who is always looking to improve, stay humble, and grow. I always believe anything can be done as long as you have the courage to try and the determination to see it through. 'My idol is me in 5 years'"
    },
    {
      "value": "Serenity",
      "why": "I always try to live my life by the serenity prayer: 'Grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference.'"
    },
    {
      "value": "Creativity",
      "why": "The ability to see the world in a new way and to express yourself in a new way. I strive to put myself in situations where I can be creative and always learn."
    }
  ],
  "interests": [
    {
      "interest": "Software Development",
      "why": "I love building products that change and simplify people's lives. I am someone obssessed with details and love to build products that are both functional and aesthetically pleasing (like Iris)"
    },
    {
      "interest": "Creative Writing",
      "why": "I love writing and sharing my thoughts with the world. I write blogs in my free time, and published one for Rice"
    },
    {
      "interest": "Learning Languages",
      "why": "I love learning new languages and cultures. I have a strong relation to Greece from my family, and I am studying abroad to improve my spanish and greek speaking."
    },
    {
      "interest": "FC Barcelona",
      "why": "I've been a fan of FC Barcelona since I was a kid. The island of Poros, where my grandfather Kostas is from, has always supported Barcelona, and that tradition was passed down to me. I love to watch every game in person while I'm in Barcelona, and at the fan tavern in Houston when I'm at school."
    }
  ],
  "family": {
    "parents": [
      "Eva Douzinas",
      "John Veson"
    ],
    "siblings": [
      "Natalie Veson",
      "Konstantinos Veson"
    ],
    "pets": [
      {
        "name": "Callie",
        "note": "white golden retriever"
      },
      {
        "name": "Cooper",
        "note": "orange golden retriever"
      }
    ],
    "grandparents": [
      "Kostas Douzinas",
      "Nancy Douzinas",
      "Mary Veson",
      "Michael Veson (deceased)"
    ],
    "stories": [
      {
        "id": "veson_nautical_roots",
        "title": "Family roots in maritime software",
        "text": "Mike's grandfathers—Michael Veson (Veson Inc.) and Kostas Douzinas (Nautical Corporation)—each founded shipping software companies. His parents, John Veson and Eva Douzinas, later founded Veson Nautical, inspired by those companies. Seeing them build from the ground up shaped Mike’s belief in software’s real-world impact; he helped the family business in high school while learning to code and shipping the first Veson Nautical mobile app."
      }
    ]
  }
}