{
  "name": "Michael (Mike) Konstantinos Veson",
  "headline": "Computer Science @ Rice University | Builder · Storyteller · Student",
  "bio": "Grew up in Boston, studied abroad in Barcelona, and will be back studying at Rice in Houston in Spring 2026. I build things and think about why they matter. Software, experiences, ideas. My family built shipping software companies on both sides, and I grew up watching my parents start Veson Nautical from the ground up.",
  "work_authorization": "U.S. Citizen, Greek Citizen",
  "location": "Barcelona (Fall 2025) / Boston / New York City / Houston (Spring 2026)",
  "availability": "Actively pursuing Summer 2026 internships; available for full-time roles starting Summer 2027",
  "language_proficiency": ["English (native)", "Greek (intermediate)", "Spanish (intermediate)"],
  "education": [
    {
      "school": "Rice University",
      "degree": "B.S. Computer Science",
      "gpa": "3.88",
      "expected_grad": "May 2027"
    }
  ],
  "key_values": [
    {
      "value": "Integrity",
      "why": "Being honest with myself and others is the most important thing I can do. I want to look back on any situation and know I put my best self forward, even when it was hard."
    },
    {
      "value": "Ambition",
      "why": "My idol is me in five years. I'm always trying to close that gap. Anything can be done if you have the courage to try and the determination to see it through."
    },
    {
      "value": "Serenity",
      "why": "I live by the serenity prayer: grant me the serenity to accept the things I cannot change, the courage to change the things I can, and the wisdom to know the difference. It's how I stay grounded."
    },
    {
      "value": "Creativity",
      "why": "I want to see the world differently and make things that didn't exist before. That's why I build, why I write, why I'm drawn to storytelling."
    }
  ],
  "interests": [
    {
      "interest": "Building Products",
      "why": "I love the process of making something from nothing and watching people use it. Iris, Knight Life, the laytime system at Veson. The details matter to me."
    },
    {
      "interest": "Writing & Storytelling",
      "why": "I've kept a running document of life lessons since high school. I write to understand myself to help me improve. Long term, I want to write movies and build worlds that people can get lost in."
    },
    {
      "interest": "Languages & Culture",
      "why": "Greek is my heritage, Spanish is for fun. I'm studying abroad partly to get better at both. I see language as a way to actually understand a place."
    },
    {
      "interest": "FC Barcelona",
      "why": "My grandfather Kostas is from Poros, and the island has always supported Barcelona. That got passed down to me. I watch every game I can in person while I'm here, and at the fan tavern in Houston when I'm at school."
    }
  ],
  "family": {
    "parents": [
      "Eva Douzinas",
      "John Veson"
    ],
    "siblings": [
      "Natalie Veson",
      "Konstantinos Veson"
    ],
    "pets": [
      {
        "name": "Callie",
        "note": "white golden retriever"
      },
      {
        "name": "Cooper",
        "note": "orange golden retriever"
      }
    ],
    "grandparents": [
      "Kostas Douzinas",
      "Nancy Douzinas",
      "Mary Veson",
      "Michael Veson (deceased)"
    ],
    "stories": [
      {
        "id": "veson_nautical_roots",
        "title": "Family roots in maritime software",
        "text": "Both my grandfathers founded shipping software companies. Michael Veson started Veson Inc., Kostas Douzinas started Nautical Corporation. My parents met, and later started Veson Nautical together. I grew up watching them build it from the ground up. In high school I helped out and ended up shipping the first Veson Nautical mobile app. That's where I learned what software can actually do for people."
      }
    ]
  }
}